## Plan Result (ptl-jenkins)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.jenkins-webhook-relay.azurerm_role_assignment.keda_servicebus_data_receiver
* Update
  * module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow
  * module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "logic_app_workflow" {
        id                              = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.Logic/workflows/github-jenkins-cft-ptl"
        name                            = "github-jenkins-cft-ptl"
      ~ parameters                      = {
          - "$connections" = jsonencode(
                {
                  - servicebus_1 = {
                      - connectionId   = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
                      - connectionName = "servicebus-connection"
                      - id             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Web/locations/uksouth/managedApis/servicebus"
                    }
                }
            ) -> null
        }
        tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ workflow_parameters             = {
          - "$connections" = jsonencode(
                {
                  - defaultValue = {}
                  - type         = "Object"
                }
            ) -> null
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "logic_app_deployment" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.Resources/deployments/logic-app-deployment"
        name                = "logic-app-deployment"
      ~ parameters_content  = jsonencode(
          ~ {
              - rg               = {
                  - value = ""
                }
              - servicebus_queue = {
                  - value = "jenkins"
                }
                # (5 unchanged attributes hidden)
            }
        )
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ commonTags       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location         = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ logic_app_name   = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ rg               = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ sb_con_name      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ servicebus_queue = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ subscription_id  = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
                # (5 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_role_assignment.keda_servicebus_data_receiver will be created
  + resource "azurerm_role_assignment" "keda_servicebus_data_receiver" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7c9d1cd-c0b8-446e-ae0c-51f0f1f206ed"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Receiver"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-cft-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":29,"Program":"tfcmt","SHA1":"","Target":"ptl-jenkins","Vars":{}} -->